<a href="https://colab.research.google.com/github/besherh/Machine-Learning-Course/blob/master/1-Introduction/pandas_practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.DataFrame({
   'col1': ['Item0', 'Item0', 'Item1', 'Item1'],
   'col2': ['Gold', 'Bronze', 'Gold', 'Silver'],
   'col3': [1, 2, np.nan, 4]
})

df

    col1    col2  col3
0  Item0    Gold   1.0
1  Item0  Bronze   2.0
2  Item1    Gold   NaN
3  Item1  Silver   4.0

Previewing Data
To preview the data and the metadata of a dataframe you can use the following functions:

In [ ]:
# Displays the top 5 rows.
df.head()

    col1    col2  col3
0  Item0    Gold   1.0
1  Item0  Bronze   2.0
2  Item1    Gold   NaN
3  Item1  Silver   4.0

In [ ]:
# displays the last rows

In [ ]:
# The number of columns

#Sorting

sort values by col1, then col2 in ascending order

In [ ]:
#sort values

# Selecting/Querying
Individual columns can be selected with the [] operator or directly as attributes:
# Selects only the column named 'col1';
# Select two columns col1,col2

In [ ]:
#select columns

You can also select by absolute coordinates/position in the frame. Indices are zero based:

# Selects second row
# Selects rows 1-to-3


# Query by a single column value
df[df.col3 > 0] 

# Query by a single column, if it is in a list of predefined values
df[df['col2'].isin(['Gold', 'Silver'])] 

# A conjunction query using two columns
df[(df['col3'] > 0) & (df['col2'] == 'Silver')] 

# A disjunction query using two columns
df[(df['col3'] > 0) | (df['col2'] == 'Silver')]

# A query checking the textual content of the cells
df[df.col2.str.contains('ilver')]

In [ ]:
#use the code from above cell to see the results of each query

#Modifying Data Frames

# Modifies the cell at 1,1, assign vaue 'Bronze again'


# change the values in col3 to 'HelloPD'

# Removes all rows with any missing values.

In [ ]:
#your code here

#Basic plotting

In [ ]:
#run the following code to create a new data frame
plot_df = pd.DataFrame({
    'col1': [1, 3, 2, 4],
    'col2': [3, 6, 5, 1],
    'col3': [4, 7, 6, 2],
})

plot_df

   col1  col2  col3
0     1     3     4
1     3     6     7
2     2     5     6
3     4     1     2

In [ ]:
#use plot function to plot plot_df

In [ ]:
#plot bar chart for plot_df
# Use kind='hbar' for horizontal bars, and stacked=True to stack the groups